TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
/*
 * ESP32-S3 N16R8 Remote Controller - COMPLETE PRODUCTION FIRMWARE (Transmitter)
 * ==============================================================================
 * Dedicated handheld remote with 1.3" OLED display for the PTZ Camera Mount.
 *
 * Hardware Architecture:
 * ------------------------------------------------------------------------------
 *   - MCU: ESP32-S3 N16R8 (16MB Flash, 8MB OPI PSRAM)
 *   - Display: 1.3" 128x64 OLED (Adafruit SH110X / SH1106G) via I2C at 400 kHz
 *       SDA: GPIO 8
 *       SCL: GPIO 9
 *   - Battery & Power Sensing:
 *       PIN_BATT_ADC  : GPIO 1 (100k/100k divider, calibration factor 2.23f)
 *       PIN_USB_SENSE : GPIO 2 (USB 5V presence detection ADC)
 *   - Joystick Controls:
 *       Left Stick VRx (Pan)  : GPIO 4 (ADC1_CH3) -> PAN (Left = CCW, Right = CW)
 *       Left Stick VRy (Aux)  : GPIO 5 (ADC1_CH4) -> AUX / Reserved
 *       Left Stick Click (SW) : GPIO 15 (INPUT_PULLUP)
 *       Right Stick VRx (Aux) : GPIO 6 (ADC1_CH5) -> AUX / Reserved
 *       Right Stick VRy (Tilt): GPIO 7 (ADC1_CH6) -> TILT (Up = Up, Down = Down)
 *       Right Stick Click (SW): GPIO 16 (INPUT_PULLUP)
 *   - Pushbutton Controls (Auto-Calibrated Resting Baseline):
 *       Color Button 1: GPIO 38 -> Zoom In / Tele (Held: +1000)
 *       Color Button 2: GPIO 39 -> Zoom Out / Wide (Held: -1000)
 *       Color Button 3: GPIO 40 -> Quick Recall Preset 1
 *       Color Button 4: GPIO 41 -> Quick Recall Preset 2
 *       Color Button 5: GPIO 42 -> Quick Recall Preset 3
 *   - Rotary Encoder (HW-787AB Quadrature) & Navigation:
 *       Phase A (TRA) : GPIO 10 (Interrupt, any edge)
 *       Phase B (TRB) : GPIO 11 (Interrupt, any edge)
 *       Push (PSH)    : GPIO 12 -> Menu Select / Confirm
 *       Confirm (CON) : GPIO 13 -> Menu Select / Confirm / Open Menu
 *       Back (BAK)    : GPIO 17 -> Back / Cancel / Delete Character
 *
 * Required Libraries (Arduino Library Manager):
 *   - Adafruit SH110X (by Adafruit)
 *   - Adafruit GFX Library (by Adafruit)
 *
 * Board Settings (Arduino IDE):
 *   - Board: ESP32S3 Dev Module
 *   - Flash Size: 16MB (128Mb)
 *   - PSRAM: "OPI PSRAM"
 *   - USB CDC On Boot: "Enabled"
 *   - Upload Speed: 921600
 */

#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SH110X.h>
#include <WiFi.h>
#include <esp_now.h>
#include <esp_wifi.h>
#include <Preferences.h>

// Forward declarations
struct Button;
struct PtzPacket;
struct MountTelemetryPacket;

// ---------------------------------------------------------------------------
// Pin Definitions
// ---------------------------------------------------------------------------
#define PIN_BATT_ADC      1   // Battery voltage divider (100k/100k)
#define PIN_USB_SENSE     2   // USB 5V presence sense (ADC)

#define PIN_LJOY_X        4   // Left joystick VRx  -> PAN
#define PIN_LJOY_Y        5   // Left joystick VRy  -> AUX / Reserved
#define PIN_LJOY_SW      15   // Left joystick click (active LOW)

#define PIN_RJOY_X        6   // Right joystick VRx -> AUX / Reserved
#define PIN_RJOY_Y        7   // Right joystick VRy -> TILT
#define PIN_RJOY_SW      16   // Right joystick click (active LOW)

#define PIN_I2C_SDA       8   // OLED I2C SDA
#define PIN_I2C_SCL       9   // OLED I2C SCL

#define PIN_ENC_A        10   // HW-787AB encoder phase A (TRA)
#define PIN_ENC_B        11   // HW-787AB encoder phase B (TRB)
#define PIN_ENC_BTN      12   // Encoder push (PSH, active LOW) -> Confirm / Select
#define PIN_BTN_CON      13   // Confirm button (active LOW) -> Confirm / Select
#define PIN_BTN_BAK      17   // Back button    (active LOW) -> Back / Delete / Exit

// 5 Color pushbuttons
// Btn 1: Zoom In, Btn 2: Zoom Out, Btn 3..5: Quick Recall Presets 1..3
static const uint8_t PIN_COLOR_BTNS[5] = {38, 39, 40, 41, 42};

// ---------------------------------------------------------------------------
// Display Configuration (Adafruit SH110X 1.3" OLED)
// ---------------------------------------------------------------------------
#define SCREEN_WIDTH   128
#define SCREEN_HEIGHT   64
#define OLED_ADDR      0x3C
#define I2C_CLOCK   400000UL        // Fast I2C: 400 kHz
#define STATUS_BAR_H     11

Adafruit_SH1106G display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, -1);
bool displayActive = false;

// ---------------------------------------------------------------------------
// Battery Configuration (5000 mAh Li-Po / 18650 Pack)
// ---------------------------------------------------------------------------
const int   BATTERY_CAPACITY_MAH    = 5000;
const float BATT_CALIBRATION_FACTOR = 2.23f;
const float BATT_V_MIN              = 3.2f;   // 0%
const float BATT_V_MAX              = 4.2f;   // 100%
const float TP4056_CHARGE_MA        = 1000.0f;// 1A charge rate
const int   USB_SENSE_THRESHOLD     = 1000;   // raw ADC threshold for 5V USB
#define ADC_SAMPLES                 8

// ---------------------------------------------------------------------------
// ESP-NOW Packet Protocol (MATCH WITH MOUNT RX)
// ---------------------------------------------------------------------------
#define PKT_PAIR_REQ      0x01
#define PKT_PAIR_ACK      0x02
#define PKT_CONTROL       0x03
#define PKT_SAVE_PRESET   0x04
#define PKT_GOTO_PRESET   0x05
#define PKT_START_HOMING  0x06
#define PKT_TELEMETRY     0x07

// Keep in sync with the mount receiver's ZOOM_FULL_RANGE_MS: full optical zoom travel (0 ms = Wide)
#define ZOOM_FULL_RANGE_MS  13000

struct __attribute__((packed)) PtzPacket {
  uint8_t  type;                  // PKT_*
  uint8_t  mac[6];                // sender MAC (pairing handshake)
  int16_t  pan;                   // -1000..+1000 velocity command
  int16_t  tilt;                  // -1000..+1000 velocity command
  int16_t  zoom;                  // -1000..+1000 zoom command (+ Tele/In, - Wide/Out)
  int16_t  auxX;                  // right stick X (reserved)
  uint16_t buttons;               // BTNBIT_* bitfield
  uint8_t  presetId;              // Preset slot (1..8) for SAVE/GOTO
  uint8_t  seq;                   // rolling sequence number
};

struct __attribute__((packed)) MountTelemetryPacket {
  uint8_t  type;                  // PKT_TELEMETRY (0x07)
  uint8_t  mac[6];                // Mount MAC
  uint8_t  panUartOk;             // 1 if Pan TMC2209 version == 0x21, else 0
  uint8_t  panVersion;            // IC version register value (e.g. 0x21)
  uint8_t  tiltUartOk;            // 1 if Tilt TMC2209 version == 0x21, else 0
  uint8_t  tiltVersion;           // IC version register value (e.g. 0x21)
  uint8_t  panHallDetected;       // 1 if magnet detected (LOW on pin), 0 if clear
  uint8_t  tiltHallDetected;      // 1 if magnet detected (LOW on pin), 0 if clear
  int8_t   panSide;               // -1 = Left (CCW), 0 = Center, +1 = Right (CW)
  int8_t   tiltSide;              // -1 = Down, 0 = Center, +1 = Up
  int32_t  panSteps;              // Current pan position in steps
  int32_t  tiltSteps;             // Current tilt position in steps
  float    panDeg;                // Calculated pan angle in degrees (-40.0 .. +40.0)
  float    tiltDeg;               // Calculated tilt angle in degrees (-45.0 .. +45.0)
  uint16_t zoomMs;                // Current zoom dead-reckoning position (0..ZOOM_FULL_RANGE_MS)
  uint8_t  zoomPct;               // Zoom percentage (0..100%)
  uint8_t  isHomed;               // 1 if homing complete
  uint8_t  state;                 // 0=IDLE, 1=LIVE_MOVING, 2=HOMING, 3=GOTO_PRESET
  uint8_t  activePreset;          // Target preset ID if moving
  char     eventMsg[32];          // Null-terminated event string
};

enum ButtonBits : uint16_t {
  BTNBIT_LJOY      = 1 << 0,
  BTNBIT_RJOY      = 1 << 1,
  BTNBIT_PSH       = 1 << 2,
  BTNBIT_CON       = 1 << 3,
  BTNBIT_BAK       = 1 << 4,
  BTNBIT_C1        = 1 << 5,
  BTNBIT_C2        = 1 << 6,
  BTNBIT_C3        = 1 << 7,
  BTNBIT_C4        = 1 << 8,
  BTNBIT_C5        = 1 << 9,
  BTNBIT_ZOOM_SLOW = 1 << 10,
};

// ---------------------------------------------------------------------------
// UI & Menu Model (Professional Remote OS)
// ---------------------------------------------------------------------------
enum UiMode : uint8_t {
  UI_LIVE = 0,
  UI_MENU,
  UI_PRESETS_LIST,
  UI_PRESET_ACTION,
  UI_NAME_EDITOR,
  UI_HOMING,
  UI_LOGS,
  UI_DIAG
};

enum MenuItem : uint8_t {
  MI_PRESETS = 0,
  MI_HOME,
  MI_DIAG,
  MI_LOGS,
  MI_BRIGHT,
  MI_SENS,
  MI_INV_PAN,
  MI_INV_TILT,
  MI_EXIT,
  MI_COUNT
};

