TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
const char* MENU_NAMES[MI_COUNT] = {
  "Preset Hub", "Home Mount", "Mount Diag", "System Logs",
  "Brightness", "Sensitivity", "Invert Pan", "Invert Tilt", "Exit Menu"
};

enum PresetActionItem : uint8_t {
  PACT_GOTO = 0,
  PACT_SAVE,
  PACT_RENAME,
  PACT_BACK,
  PACT_COUNT
};

const char* PRESET_ACTION_NAMES[PACT_COUNT] = {
  "Goto Position", "Save Current Framing", "Rename Preset", "Back"
};

// ---------------------------------------------------------------------------
// Remote Preset Cache & Custom Naming (Upper & Lower Case Support)
// ---------------------------------------------------------------------------
struct PresetSummary {
  bool    valid;
  char    name[12];
  float   panDeg;
  float   tiltDeg;
  uint8_t zoomPct;
};

static const char* DEFAULT_PRESET_NAMES[8] = {
  "Pulpit", "Piano", "Choir", "Wide Stage",
  "Preset 5", "Preset 6", "Preset 7", "Preset 8"
};

PresetSummary remotePresets[8] = {};
uint8_t activePresetSlot   = 1; // Currently selected active slot (1..8)
uint8_t presetListSelected = 0; // Highlighted slot index in list (0..7)
uint8_t presetActSelected  = 0; // Highlighted action in Preset Action (0..3)

// Name Editor State
char    editNameBuffer[12] = "";
uint8_t editNameSlotIdx    = 0;
int16_t editCharIdx        = 0;

// Character set ribbon with UPPERCASE, LOWERCASE, numbers, symbols, DEL, and OK
static const char CHAR_SET[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789 -_#&./";
#define CHAR_SET_LEN ((int16_t)(sizeof(CHAR_SET) - 1))
#define CHAR_CODE_DEL  (CHAR_SET_LEN)
#define CHAR_CODE_SAVE (CHAR_SET_LEN + 1)
#define TOTAL_EDITOR_SYMBOLS (CHAR_SET_LEN + 2)

// Banner Notifications
char     bannerText[28]  = "";
uint32_t bannerExpireMs  = 0;

void showBanner(const char* txt, uint32_t ms = 2500) {
  strncpy(bannerText, txt, sizeof(bannerText) - 1);
  bannerText[sizeof(bannerText) - 1] = '\0';
  bannerExpireMs = millis() + ms;
}

// Dedicated System Log Ring Buffer
#define MAX_LOG_LINES 15
#define LOG_LINE_LEN  26
char    logLines[MAX_LOG_LINES][LOG_LINE_LEN];
uint8_t logHead   = 0;
uint8_t logTotal  = 0;
int8_t  logScroll = 0; // 0 = newest at bottom, positive = scrolled up

void addLog(const char* msg) {
  if (!msg || strlen(msg) == 0) return;
  uint8_t prev = (logHead == 0) ? (MAX_LOG_LINES - 1) : (logHead - 1);
  if (logTotal > 0 && strcmp(logLines[prev], msg) == 0) return; // ignore duplicates

  strncpy(logLines[logHead], msg, LOG_LINE_LEN - 1);
  logLines[logHead][LOG_LINE_LEN - 1] = '\0';
  logHead = (logHead + 1) % MAX_LOG_LINES;
  if (logTotal < MAX_LOG_LINES) logTotal++;
  logScroll = 0;
}

// ---------------------------------------------------------------------------
// ESP-NOW Link State
// ---------------------------------------------------------------------------
#define TX_INTERVAL_MS    20      // 50 Hz control stream
#define LINK_FAIL_LIMIT   250     // ~5s consecutive TX failures before re-scanning

enum LinkState : uint8_t { LINK_SCAN = 0, LINK_PAIRED };

LinkState             linkState    = LINK_SCAN;
uint8_t               mountMac[6]  = {0};
uint8_t               mountChannel = 0;
uint8_t               scanChannel  = 1;
uint8_t               activeChannel = 1;
uint32_t              nextScanMs   = 0;
uint32_t              lastTxMs     = 0;
uint8_t               txSeq        = 0;
volatile bool         pairAckFlag  = false;
volatile uint8_t      pairAckMac[6];
volatile uint32_t     txFailCount  = 0;

static const uint8_t BCAST_MAC[6] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};

// Telemetry State from Mount
MountTelemetryPacket latestMountTelem = {};
bool     hasMountTelem        = false;
uint32_t lastMountTelemMs     = 0;
char     lastLoggedEvent[32]  = "";
uint8_t  lastMountState       = 0;

// ---------------------------------------------------------------------------
// Persistent Settings (NVS)
// ---------------------------------------------------------------------------
struct Settings {
  uint8_t brightness;             // SH110X contrast 0..255
  float   sensitivity;            // joystick output scaler 0.2..3.0
  bool    invertPan;
  bool    invertTilt;
  bool    zoomSlowMode;           // true = Slow Creep Zoom, false = Fast Standard Zoom
};
Settings settings = {128, 1.0f, false, false, false};

Preferences prefs;

void loadRemotePresets() {
  prefs.begin("rem_p", true);
  for (uint8_t i = 0; i < 8; i++) {
    char k[16];
    snprintf(k, sizeof(k), "p%u_v", i);
    remotePresets[i].valid = prefs.getBool(k, false);

    snprintf(k, sizeof(k), "p%u_name", i);
    String sName = prefs.getString(k, DEFAULT_PRESET_NAMES[i]);
    if (sName.length() == 0) sName = DEFAULT_PRESET_NAMES[i];
    strncpy(remotePresets[i].name, sName.c_str(), sizeof(remotePresets[i].name) - 1);
    remotePresets[i].name[sizeof(remotePresets[i].name) - 1] = '\0';

    if (remotePresets[i].valid) {
      snprintf(k, sizeof(k), "p%u_p", i); remotePresets[i].panDeg = prefs.getFloat(k, 0.0f);
      snprintf(k, sizeof(k), "p%u_t", i); remotePresets[i].tiltDeg = prefs.getFloat(k, 0.0f);
      snprintf(k, sizeof(k), "p%u_z", i); remotePresets[i].zoomPct = prefs.getUChar(k, 0);
    }
  }
  prefs.end();
}

void savePresetToNVS(uint8_t idx) {
  if (idx >= 8) return;
  prefs.begin("rem_p", false);
  char k[16];
  snprintf(k, sizeof(k), "p%u_v", idx);    prefs.putBool(k, remotePresets[idx].valid);
  snprintf(k, sizeof(k), "p%u_name", idx); prefs.putString(k, String(remotePresets[idx].name));
  snprintf(k, sizeof(k), "p%u_p", idx);    prefs.putFloat(k, remotePresets[idx].panDeg);
  snprintf(k, sizeof(k), "p%u_t", idx);    prefs.putFloat(k, remotePresets[idx].tiltDeg);
  snprintf(k, sizeof(k), "p%u_z", idx);    prefs.putUChar(k, remotePresets[idx].zoomPct);
  prefs.end();
}

void loadSettings() {
  prefs.begin("ptz", true);
  settings.brightness   = prefs.getUChar("bright", 128);
  settings.sensitivity  = prefs.getFloat("sens", 1.0f);
  settings.invertPan    = prefs.getBool("invP", false);
  settings.invertTilt   = prefs.getBool("invT", false);
  settings.zoomSlowMode = prefs.getBool("zmSlow", false);
  prefs.end();
}

void saveSettings() {
  prefs.begin("ptz", false);
  prefs.putUChar("bright", settings.brightness);
  prefs.putFloat("sens", settings.sensitivity);
  prefs.putBool("invP", settings.invertPan);
  prefs.putBool("invT", settings.invertTilt);
  prefs.putBool("zmSlow", settings.zoomSlowMode);
  prefs.end();
}

void saveLink() {
  prefs.begin("ptzlink", false);
  prefs.putUChar("ch", mountChannel);
  prefs.putBytes("mac", mountMac, 6);
  prefs.end();
}

uint8_t loadLinkChannel() {
  prefs.begin("ptzlink", true);
  uint8_t ch = prefs.getUChar("ch", 1);
  prefs.end();
  return (ch >= 1 && ch <= 13) ? ch : 1;
}

// ---------------------------------------------------------------------------
// ESP-NOW Callbacks & Peer Handling
// ---------------------------------------------------------------------------
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
void onEspNowRecv(const esp_now_recv_info_t* info, const uint8_t* data, int len) {
  const uint8_t* senderMac = info->src_addr;
#else
void onEspNowRecv(const uint8_t* senderMac, const uint8_t* data, int len) {
#endif
  if (len == (int)sizeof(PtzPacket)) {
    const PtzPacket* pkt = (const PtzPacket*)data;
    if (pkt->type == PKT_PAIR_ACK) {
      memcpy((void*)pairAckMac, senderMac, 6);
      pairAckFlag = true;
    }
  } else if (len == (int)sizeof(MountTelemetryPacket)) {
    const MountTelemetryPacket* telem = (const MountTelemetryPacket*)data;
    if (telem->type == PKT_TELEMETRY) {
      memcpy(&latestMountTelem, telem, sizeof(MountTelemetryPacket));
      hasMountTelem = true;
      lastMountTelemMs = millis();

      if (strlen(telem->eventMsg) > 0 && strcmp(telem->eventMsg, lastLoggedEvent) != 0) {
        strncpy(lastLoggedEvent, telem->eventMsg, sizeof(lastLoggedEvent) - 1);
        lastLoggedEvent[sizeof(lastLoggedEvent) - 1] = '\0';
        Serial.printf("\n>>> [MOUNT EVENT] %s <<<\n\n", telem->eventMsg);

        // Show banner notification and add to dedicated log console
        showBanner(telem->eventMsg, 3000);
        addLog(telem->eventMsg);
      }
    }
  }
}

