TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
#if ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowSent(const wifi_tx_info_t*, esp_now_send_status_t status) {
#else
void onEspNowSent(const uint8_t*, esp_now_send_status_t status) {
#endif
  if (status == ESP_NOW_SEND_FAIL) {
    txFailCount++;
  } else {
    txFailCount = 0;
  }
}

bool espNowAddPeer(const uint8_t* mac, uint8_t channel) {
  if (esp_now_is_peer_exist(mac)) esp_now_del_peer(mac);
  esp_now_peer_info_t peer = {};
  memcpy(peer.peer_addr, mac, 6);
  peer.channel = channel;         // 0 = follow current STA home channel!
  peer.encrypt = false;
  peer.ifidx = WIFI_IF_STA;
  return esp_now_add_peer(&peer) == ESP_OK;
}

// ---------------------------------------------------------------------------
// Rotary Encoder (Quadrature Interrupt Driven)
// ---------------------------------------------------------------------------
volatile int16_t encSteps  = 0;
volatile uint8_t encLastAB = 0;

static const int8_t ENC_TABLE[16] = {
   0, -1,  1,  0,
   1,  0,  0, -1,
  -1,  0,  0,  1,
   0,  1, -1,  0
};

void IRAM_ATTR encoderISR() {
  uint8_t ab = (digitalRead(PIN_ENC_A) << 1) | digitalRead(PIN_ENC_B);
  encSteps += ENC_TABLE[(encLastAB << 2) | ab];
  encLastAB = ab;
}

int encoderDetents() {
  static int16_t accum = 0;
  noInterrupts();
  int16_t steps = encSteps;
  encSteps = 0;
  interrupts();
  accum += steps;
  int detents = accum / 4;
  accum -= detents * 4;
  return detents;
}

// ---------------------------------------------------------------------------
// Universal Auto-Calibrating Button Engine
// ---------------------------------------------------------------------------
// Auto-samples resting voltage levels at boot to support Active-LOW, Active-HIGH,
// Normally Closed switches, and pins with onboard pulldowns (e.g. WS2812 DIN).
struct Button {
  uint8_t  pin;
  bool     restingState;  // Sampled at boot (unpressed level)
  bool     stable;        // true = pressed, false = unpressed
  bool     lastRaw;
  bool     wasPressed;    // One-shot click event
  uint32_t lastChangeMs;
  uint32_t pressStartMs;
  bool     longPressHandled;
};

void buttonInit(Button &b, uint8_t pin) {
  b.pin = pin;
  pinMode(pin, INPUT_PULLUP);
  b.restingState = digitalRead(pin); // Initial baseline sample
  b.stable = false;
  b.lastRaw = false;
  b.wasPressed = false;
  b.lastChangeMs = 0;
  b.pressStartMs = 0;
  b.longPressHandled = false;
}

Button btnLJoy, btnRJoy, btnEnc, btnCon, btnBak, btnColor[5];

void calibrateButtonRestingState() {
  delay(60); // Allow all external wiring and pull-ups to fully settle
  btnLJoy.restingState = digitalRead(btnLJoy.pin);
  btnRJoy.restingState = digitalRead(btnRJoy.pin);
  btnEnc.restingState  = digitalRead(btnEnc.pin);
  btnCon.restingState  = digitalRead(btnCon.pin);
  btnBak.restingState  = digitalRead(btnBak.pin);
  for (uint8_t i = 0; i < 5; i++) {
    btnColor[i].restingState = digitalRead(btnColor[i].pin);
  }
}

void buttonUpdate(Button &b) {
  // Raw is TRUE whenever the pin differs from its resting state (user is pressing the button)
  bool raw = (digitalRead(b.pin) != b.restingState);
  uint32_t now = millis();
  if (raw != b.lastRaw) {
    b.lastRaw = raw;
    b.lastChangeMs = now;
  }
  if ((now - b.lastChangeMs) > 20 && raw != b.stable) {
    b.stable = raw;
    if (b.stable) {
      b.pressStartMs = now;
      b.longPressHandled = false;
      b.wasPressed = true;
    }
  }
}

bool buttonPressed(Button &b) {
  if (b.wasPressed) {
    b.wasPressed = false;
    return true;
  }
  return false;
}

bool buttonLongPressed(Button &b, uint32_t holdMs = 1200) {
  if (b.stable && !b.longPressHandled && (millis() - b.pressStartMs >= holdMs)) {
    b.longPressHandled = true;
    return true;
  }
  return false;
}

void updateAllButtons() {
  buttonUpdate(btnLJoy);
  buttonUpdate(btnRJoy);
  buttonUpdate(btnEnc);
  buttonUpdate(btnCon);
  buttonUpdate(btnBak);
  for (uint8_t i = 0; i < 5; i++) {
    buttonUpdate(btnColor[i]);
  }
}

uint16_t buildButtonBits() {
  uint16_t b = 0;
  if (btnLJoy.stable) b |= BTNBIT_LJOY;
  if (btnRJoy.stable) b |= BTNBIT_RJOY;
  if (btnEnc.stable)  b |= BTNBIT_PSH;
  if (btnCon.stable)  b |= BTNBIT_CON;
  if (btnBak.stable)  b |= BTNBIT_BAK;
  for (uint8_t i = 0; i < 5; i++)
    if (btnColor[i].stable) b |= (BTNBIT_C1 << i);
  if (settings.zoomSlowMode) b |= BTNBIT_ZOOM_SLOW;
  return b;
}

// ---------------------------------------------------------------------------
// Analog Inputs & Dynamic Calibration
// ---------------------------------------------------------------------------
uint16_t analogReadAvg(uint8_t pin) {
  uint32_t acc = 0;
  for (uint8_t i = 0; i < ADC_SAMPLES; i++) acc += analogRead(pin);
  return acc / ADC_SAMPLES;
}

int joyCenterLX = 2048, joyCenterLY = 2048;
int joyCenterRX = 2048, joyCenterRY = 2048;

int* joyCenterFor(uint8_t pin) {
  switch (pin) {
    case PIN_LJOY_X: return &joyCenterLX;
    case PIN_LJOY_Y: return &joyCenterLY;
    case PIN_RJOY_X: return &joyCenterRX;
    default:         return &joyCenterRY;
  }
}

void calibrateJoysticks() {
  const uint8_t pins[4] = {PIN_LJOY_X, PIN_LJOY_Y, PIN_RJOY_X, PIN_RJOY_Y};
  for (uint8_t pass = 0; pass < 16; pass++)
    for (uint8_t i = 0; i < 4; i++)
      *joyCenterFor(pins[i]) = analogReadAvg(pins[i]);
}

float joyAxis(uint8_t pin) {
  int   raw    = analogReadAvg(pin);
  int   center = *joyCenterFor(pin);
  float delta  = (float)(raw - center);
  float v = (delta >= 0) ? delta / (4095.0f - center) : delta / (float)center;
  if (fabsf(v) < 0.12f) return 0.0f;
  return constrain(v, -1.0f, 1.0f);
}

// ---------------------------------------------------------------------------
// Battery & Power Monitoring
// ---------------------------------------------------------------------------
float readBatteryVoltage() {
  return (analogReadMilliVolts(PIN_BATT_ADC) * BATT_CALIBRATION_FACTOR) / 1000.0f;
}

float filteredBatteryVoltage() {
  static float filtered = 0.0f;
  static bool  primed   = false;
  float raw = readBatteryVoltage();
  if (!primed) { filtered = raw; primed = true; }
  filtered += (raw - filtered) * 0.05f;
  return filtered;
}

