TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
int batteryPercent(float volts) {
  static int lastPct = -1;
  float pct = (volts - BATT_V_MIN) / (BATT_V_MAX - BATT_V_MIN) * 100.0f;
  int currentPct = constrain((int)(pct + 0.5f), 0, 100);
  if (lastPct == -1) lastPct = currentPct;
  if (abs(currentPct - lastPct) >= 2) lastPct = currentPct;
  return lastPct;
}

bool usbConnected() {
  return analogReadAvg(PIN_USB_SENSE) > USB_SENSE_THRESHOLD;
}

uint16_t chargeEtaMinutes(int pct) {
  float remainingMah = BATTERY_CAPACITY_MAH * (100 - pct) / 100.0f;
  return (uint16_t)((remainingMah / TP4056_CHARGE_MA) * 60.0f * 1.3f);
}

// ---------------------------------------------------------------------------
// ESP-NOW Link Management
// ---------------------------------------------------------------------------
void updateLink(uint32_t now) {
  if (linkState == LINK_PAIRED) {
    if (txFailCount > LINK_FAIL_LIMIT) {
      linkState = LINK_SCAN;
      txFailCount = 0;
      esp_now_del_peer(mountMac);
      Serial.println("[LINK] Link lost, re-scanning channels...");
    }
    return;
  }

  // Handle successful ACK from Mount
  if (pairAckFlag) {
    pairAckFlag = false;
    memcpy(mountMac, (const void*)pairAckMac, 6);
    mountChannel = activeChannel;
    if (espNowAddPeer(mountMac, 0)) { // 0 = follow current channel!
      linkState = LINK_PAIRED;
      txFailCount = 0;
      saveLink();
      Serial.printf("[PAIR SUCCESS] Connected to Mount MAC: %02X:%02X:%02X:%02X:%02X:%02X on Channel %u!\n",
                    mountMac[0], mountMac[1], mountMac[2], mountMac[3], mountMac[4], mountMac[5], mountChannel);
    }
    return;
  }

  // Scan channels broadcasting PAIR_REQ
  if (now >= nextScanMs) {
    nextScanMs = now + 150;
    activeChannel = scanChannel;
    esp_wifi_set_channel(scanChannel, WIFI_SECOND_CHAN_NONE);
    PtzPacket req = {};
    req.type = PKT_PAIR_REQ;
    WiFi.macAddress(req.mac);
    esp_now_send(BCAST_MAC, (uint8_t*)&req, sizeof(req));
    scanChannel = (scanChannel >= 13) ? 1 : scanChannel + 1;
  }
}

void sendControl(int16_t pan, int16_t tilt, int16_t zoom, int16_t auxX, uint16_t buttons) {
  PtzPacket pkt = {};
  pkt.type = PKT_CONTROL;
  WiFi.macAddress(pkt.mac);
  pkt.pan = pan;
  pkt.tilt = tilt;
  pkt.zoom = zoom;
  pkt.auxX = auxX;
  pkt.buttons = buttons;
  pkt.seq = txSeq++;
  esp_now_send(mountMac, (uint8_t*)&pkt, sizeof(pkt));
}

void commandSavePreset(uint8_t id) {
  if (id < 1 || id > 8) return;
  PtzPacket pkt = {};
  pkt.type = PKT_SAVE_PRESET;
  pkt.presetId = id;
  WiFi.macAddress(pkt.mac);
  esp_now_send(mountMac, (uint8_t*)&pkt, sizeof(pkt));

  // Save to local cache & NVS
  uint8_t idx = id - 1;
  remotePresets[idx].valid = true;
  remotePresets[idx].panDeg = latestMountTelem.panDeg;
  remotePresets[idx].tiltDeg = latestMountTelem.tiltDeg;
  remotePresets[idx].zoomPct = latestMountTelem.zoomPct;

  savePresetToNVS(idx);

  char b[28];
  snprintf(b, sizeof(b), "SAVED [%s]!", remotePresets[idx].name);
  showBanner(b, 2500);
  addLog(b);
  activePresetSlot = id;
  Serial.printf("\n>>> [PRESET] Saved Preset %u [%s] to Mount & Remote! <<<\n\n", id, remotePresets[idx].name);
}

void commandGotoPreset(uint8_t id) {
  if (id < 1 || id > 8) return;
  PtzPacket pkt = {};
  pkt.type = PKT_GOTO_PRESET;
  pkt.presetId = id;
  WiFi.macAddress(pkt.mac);
  esp_now_send(mountMac, (uint8_t*)&pkt, sizeof(pkt));

  uint8_t idx = id - 1;
  char b[28];
  snprintf(b, sizeof(b), "RECALL [%s]...", remotePresets[idx].name);
  showBanner(b, 2500);
  addLog(b);
  activePresetSlot = id;
  Serial.printf("\n>>> [RECALL] Sent GOTO Preset %u [%s] to Mount! <<<\n\n", id, remotePresets[idx].name);
}

// Fullscreen Homing Execution
UiMode   uiMode      = UI_LIVE;
MenuItem menuSel     = MI_PRESETS;
bool     menuEditing = false;

void commandStartHoming() {
  PtzPacket pkt = {};
  pkt.type = PKT_START_HOMING;
  WiFi.macAddress(pkt.mac);
  esp_now_send(mountMac, (uint8_t*)&pkt, sizeof(pkt));
  Serial.println("\n>>> [HOMING] Sent START HOMING command to Mount! <<<\n");

  uiMode = UI_HOMING;
  showBanner("HOMING MOUNT...", 4000);
  addLog("Homing Mount...");
}

// ---------------------------------------------------------------------------
// Settings Menu & UI Navigation
// ---------------------------------------------------------------------------
void handleMenuInput(int detents) {
  bool pshPress = buttonPressed(btnEnc);
  bool conPress = buttonPressed(btnCon);
  bool bakPress = buttonPressed(btnBak);
  bool actSelect = pshPress || conPress; // Both Confirm and Encoder Push act as Select / Confirm

  // Auto-manage Homing UI State: if Mount enters state 2 (HOMING), switch to UI_HOMING
  if (latestMountTelem.state == 2) {
    uiMode = UI_HOMING;
  } else if (uiMode == UI_HOMING && latestMountTelem.state != 2 && lastMountState == 2) {
    // Finished homing
    uiMode = UI_LIVE;
    showBanner("HOMING COMPLETE!", 3000);
    addLog("Homing Complete");
  }
  lastMountState = latestMountTelem.state;

  // 1. Fullscreen Homing Screen
  if (uiMode == UI_HOMING) {
    if (bakPress) {
      // Allow user to manually exit homing screen if desired
      uiMode = UI_LIVE;
    }
    return;
  }

  // 2. Live Screen
  if (uiMode == UI_LIVE) {
    if (actSelect) {
      uiMode = UI_MENU;
      menuEditing = false;
    }
    return;
  }

  // 3. Main Menu
  if (uiMode == UI_MENU) {
    if (bakPress) {
      if (menuEditing) {
        menuEditing = false;
        saveSettings();
      } else {
        uiMode = UI_LIVE;
      }
      return;
    }

    if (actSelect) {
      if (menuEditing) {
        menuEditing = false;
        saveSettings();
      } else {
        switch (menuSel) {
          case MI_PRESETS:
            uiMode = UI_PRESETS_LIST;
            break;
          case MI_HOME:
            commandStartHoming();
            break;
          case MI_DIAG:
            uiMode = UI_DIAG;
            break;
          case MI_LOGS:
            uiMode = UI_LOGS;
            logScroll = 0;
            break;
          case MI_INV_PAN:
            settings.invertPan = !settings.invertPan;
            saveSettings();
            break;
          case MI_INV_TILT:
            settings.invertTilt = !settings.invertTilt;
            saveSettings();
            break;
          case MI_EXIT:
            uiMode = UI_LIVE;
            break;
          default:
            menuEditing = true;
            break;
        }
      }
      return;
    }

