TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
    if (detents == 0) return;
    if (!menuEditing) {
      int s = (int)menuSel + detents;
      while (s < 0) s += MI_COUNT;
      menuSel = (MenuItem)(s % MI_COUNT);
    } else if (menuSel == MI_BRIGHT) {
      int b = (int)settings.brightness + detents * 15;
      settings.brightness = (uint8_t)constrain(b, 0, 255);
      display.setContrast(settings.brightness);
    } else if (menuSel == MI_SENS) {
      settings.sensitivity = constrain(settings.sensitivity + detents * 0.1f, 0.2f, 3.0f);
    }
    return;
  }

  // 4. Presets List Screen (Select 1 of 8 Presets)
  if (uiMode == UI_PRESETS_LIST) {
    if (bakPress) {
      uiMode = UI_MENU;
      return;
    }
    if (actSelect) {
      uiMode = UI_PRESET_ACTION;
      presetActSelected = 0;
      return;
    }
    if (detents != 0) {
      int s = (int)presetListSelected + detents;
      while (s < 0) s += 8;
      presetListSelected = (uint8_t)(s % 8);
    }
    return;
  }

  // 5. Preset Action Screen (Goto, Save, Rename, Back)
  if (uiMode == UI_PRESET_ACTION) {
    if (bakPress) {
      uiMode = UI_PRESETS_LIST;
      return;
    }
    if (actSelect) {
      uint8_t slot = presetListSelected + 1;
      switch ((PresetActionItem)presetActSelected) {
        case PACT_GOTO:
          commandGotoPreset(slot);
          uiMode = UI_LIVE;
          break;
        case PACT_SAVE:
          commandSavePreset(slot);
          uiMode = UI_LIVE;
          break;
        case PACT_RENAME:
          editNameSlotIdx = presetListSelected;
          strncpy(editNameBuffer, remotePresets[editNameSlotIdx].name, sizeof(editNameBuffer) - 1);
          editNameBuffer[sizeof(editNameBuffer) - 1] = '\0';
          editCharIdx = 0;
          uiMode = UI_NAME_EDITOR;
          break;
        case PACT_BACK:
        default:
          uiMode = UI_PRESETS_LIST;
          break;
      }
      return;
    }
    if (detents != 0) {
      int s = (int)presetActSelected + detents;
      while (s < 0) s += PACT_COUNT;
      presetActSelected = (uint8_t)(s % PACT_COUNT);
    }
    return;
  }

  // 6. Character Wheel Name Editor
  if (uiMode == UI_NAME_EDITOR) {
    if (bakPress) {
      // Back button acts as backspace / delete last character
      size_t len = strlen(editNameBuffer);
      if (len > 0) {
        editNameBuffer[len - 1] = '\0';
      } else {
        // If empty, exit editor
        uiMode = UI_PRESET_ACTION;
      }
      return;
    }

    if (actSelect) {
      if (editCharIdx == CHAR_CODE_DEL) {
        // Backspace action
        size_t len = strlen(editNameBuffer);
        if (len > 0) editNameBuffer[len - 1] = '\0';
      } else if (editCharIdx == CHAR_CODE_SAVE) {
        // Save & Finish
        if (strlen(editNameBuffer) == 0) {
          strncpy(editNameBuffer, DEFAULT_PRESET_NAMES[editNameSlotIdx], sizeof(editNameBuffer) - 1);
        }
        strncpy(remotePresets[editNameSlotIdx].name, editNameBuffer, sizeof(remotePresets[editNameSlotIdx].name) - 1);
        remotePresets[editNameSlotIdx].name[sizeof(remotePresets[editNameSlotIdx].name) - 1] = '\0';
        savePresetToNVS(editNameSlotIdx);

        char b[28];
        snprintf(b, sizeof(b), "RENAMED TO [%s]", editNameBuffer);
        showBanner(b, 2500);
        addLog(b);
        uiMode = UI_PRESET_ACTION;
      } else if (editCharIdx < CHAR_SET_LEN) {
        // Append selected character
        size_t len = strlen(editNameBuffer);
        if (len < sizeof(editNameBuffer) - 1) {
          editNameBuffer[len] = CHAR_SET[editCharIdx];
          editNameBuffer[len + 1] = '\0';
        }
      }
      return;
    }

    if (detents != 0) {
      int s = (int)editCharIdx + detents;
      while (s < 0) s += TOTAL_EDITOR_SYMBOLS;
      editCharIdx = (int16_t)(s % TOTAL_EDITOR_SYMBOLS);
    }
    return;
  }

  // 7. System Logs Screen (Scrollable Console)
  if (uiMode == UI_LOGS) {
    if (bakPress || actSelect) {
      uiMode = UI_MENU;
      return;
    }
    if (detents != 0) {
      int maxScroll = (logTotal > 5) ? (logTotal - 5) : 0;
      logScroll = constrain(logScroll - detents, 0, maxScroll);
    }
    return;
  }

  // 8. Mount Diag Screen
  if (uiMode == UI_DIAG) {
    if (bakPress || actSelect) {
      uiMode = UI_MENU;
      return;
    }
    return;
  }
}

void menuValueStr(MenuItem item, char* buf, size_t n) {
  switch (item) {
    case MI_BRIGHT:   snprintf(buf, n, "%u", settings.brightness); break;
    case MI_SENS:     snprintf(buf, n, "x%.1f", settings.sensitivity); break;
    case MI_INV_PAN:  snprintf(buf, n, "%s", settings.invertPan  ? "ON" : "OFF"); break;
    case MI_INV_TILT: snprintf(buf, n, "%s", settings.invertTilt ? "ON" : "OFF"); break;
    default:          buf[0] = '\0'; break;
  }
}

// ---------------------------------------------------------------------------
// OLED Display Rendering
// ---------------------------------------------------------------------------
// Grid constants (6x8 px per glyph, 21 chars max per row, content below status bar starts Y=13)
// Row Y positions inside content area (below STATUS_BAR_H=11, separator line at Y=11):
//   Row 0 (header)  : Y=13
//   Row 1           : Y=23
//   Row 2           : Y=33
//   Row 3           : Y=43
//   Row 4 (footer)  : Y=54   (last pixel row = 63)
// Margins: left=2, right content edge=125 (21*6-1), avoid writing past col 125.

// ---------------------------------------------------------------------------
// Helper: draw a centered string on a given Y row (no wrap)
// ---------------------------------------------------------------------------
static void drawCentered(const char* str, int16_t y) {
  int16_t w = (int16_t)(strlen(str) * 6);
  int16_t x = (SCREEN_WIDTH - w) / 2;
  if (x < 1) x = 1;
  display.setCursor(x, y);
  display.print(str);
}

// ---------------------------------------------------------------------------
// Helper: draw a right-aligned string ending at pixel column `rightEdge`
// ---------------------------------------------------------------------------
static void drawRightAligned(const char* str, int16_t y, int16_t rightEdge = 126) {
  int16_t w = (int16_t)(strlen(str) * 6);
  int16_t x = rightEdge - w;
  if (x < 1) x = 1;
  display.setCursor(x, y);
  display.print(str);
}

// ---------------------------------------------------------------------------
// Fullscreen Animated Radar / Satellite Search Screen when unlinked
// ---------------------------------------------------------------------------
void drawSearchingScreen() {
  uint32_t now = millis();
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Pulsing radar at top-center
  const int16_t cx = 64, cy = 22;
  uint8_t phase = (uint8_t)((now / 35) % 24);
  for (uint8_t r = phase; r < 24; r += 8) {
    if (r > 2) display.drawCircle(cx, cy, r, SH110X_WHITE);
  }
  display.fillCircle(cx, cy, 3, SH110X_WHITE);

  // Rotating sweep line
  float angle = (float)((now / 12) % 360) * 0.0174533f;
  int16_t bx = cx + (int16_t)(cosf(angle) * 19);
  int16_t by = cy + (int16_t)(sinf(angle) * 19);
  display.drawLine(cx, cy, bx, by, SH110X_WHITE);

  // "SEARCHING MOUNT" centered at Y=44
  char title[20];
  uint8_t dots = (uint8_t)((now / 400) % 4);
  snprintf(title, sizeof(title), "SEARCHING MOUNT%s",
           dots == 0 ? "" : dots == 1 ? "." : dots == 2 ? ".." : "...");
  drawCentered(title, 44);

  // Channel info, max 21 chars: "Ch 13  21dBm"
  char sub[22];
  snprintf(sub, sizeof(sub), "Ch %-2u  21 dBm  ESP-NOW", scanChannel);
  sub[21] = '\0';
  display.setCursor(2, 55);
  display.print(sub);
}

// ---------------------------------------------------------------------------
// Status Bar: Battery | Preset Badge | Link  (Y: 0..10, separator Y=11)
// ---------------------------------------------------------------------------
void drawStatusBar() {
  float volts = filteredBatteryVoltage();
  int   pct   = batteryPercent(volts);
  bool  usb   = usbConnected();

