TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // ── Left: battery gauge (cols 0..30) ──
  if (usb) {
    // Lightning bolt icon (7px wide)
    display.fillTriangle(1, 0, 5, 0, 3, 4, SH110X_WHITE);
    display.fillTriangle(3, 4, 7, 4, 2, 9, SH110X_WHITE);
    // Charge ETA, max 5 chars "999m" → col 9
    char eta[6];
    snprintf(eta, sizeof(eta), "%um", chargeEtaMinutes(pct));
    display.setCursor(9, 1);
    display.print(eta);
  } else {
    // Battery outline 13x8 + nub 2x4
    display.drawRect(0, 1, 13, 8, SH110X_WHITE);
    display.fillRect(13, 3, 2, 4, SH110X_WHITE);
    int fillW = (11 * pct) / 100;
    if (fillW > 0) display.fillRect(1, 2, fillW, 6, SH110X_WHITE);
    // Pct text, max "100%" = 4 chars → cols 15..38
    char pctStr[5];
    snprintf(pctStr, sizeof(pctStr), "%d%%", pct);
    display.setCursor(16, 1);
    display.print(pctStr);
  }

  // ── Right: link badge, right-aligned to col 126, max 6 chars ──
  // "[LINK]" or "[SCAN]"
  const char* linkBadge = (linkState == LINK_PAIRED) ? "[LINK]" : "[SCAN]";
  drawRightAligned(linkBadge, 1, 127);

  // ── Center: active preset name badge, max 8 chars + brackets = 10 chars ──
  // Sits between col 40 and col 86 (centered)
  uint8_t activeIdx = activePresetSlot - 1;
  const char* activeName = (activeIdx < 8 && strlen(remotePresets[activeIdx].name) > 0)
                           ? remotePresets[activeIdx].name
                           : DEFAULT_PRESET_NAMES[activeIdx];
  char badge[12];
  snprintf(badge, sizeof(badge), "[%.8s]", activeName);
  // Force center between the two flanking elements (col 40..86)
  int16_t badgeW = (int16_t)(strlen(badge) * 6);
  int16_t badgeX = (SCREEN_WIDTH - badgeW) / 2;
  if (badgeX < 36) badgeX = 36;
  display.setCursor(badgeX, 1);
  display.print(badge);

  // ── Separator line ──
  display.drawFastHLine(0, STATUS_BAR_H, SCREEN_WIDTH, SH110X_WHITE);
}

// ---------------------------------------------------------------------------
// Pan/Tilt dial widget (used on live view)
// ---------------------------------------------------------------------------
void drawDial(int16_t cx, int16_t cy, int16_t r, float val, bool isVertical, const char* label) {
  display.drawCircle(cx, cy, r, SH110X_WHITE);
  display.drawFastHLine(cx - r + 2, cy, 2 * r - 3, SH110X_WHITE);
  display.drawFastVLine(cx, cy - r + 2, 2 * r - 3, SH110X_WHITE);

  int16_t dx = cx, dy = cy;
  if (isVertical) dy = cy - (int16_t)(val * (r - 4));
  else            dx = cx + (int16_t)(val * (r - 4));
  display.fillCircle(dx, dy, 2, SH110X_WHITE);

  int16_t tx = cx - (int16_t)(strlen(label) * 3);
  display.setCursor(tx, cy + r + 2);
  display.setTextColor(SH110X_WHITE);
  display.print(label);
}

// ---------------------------------------------------------------------------
// Main Live View (below status bar)
// ---------------------------------------------------------------------------
void drawMainUi(int16_t pan, int16_t tilt, int16_t zoom) {
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Left dial: Pan   (cx=22, cy=35, r=11)
  drawDial(22, 35, 11, pan / 1000.0f, false, "PAN");

  // Right dial: Tilt (cx=105, cy=35, r=11)
  drawDial(105, 35, 11, tilt / 1000.0f, true, "TILT");

  // Center telemetry column (X=44..84, 7 chars max per line)
  // Row Y=14: Pan angle   "P: +40°"
  // Row Y=24: Tilt angle  "T: -45°"
  // Row Y=34: Zoom pct    "Z: 100%"
  display.setCursor(44, 14);
  display.printf("P:%+4.0f\xF7", latestMountTelem.panDeg);
  display.setCursor(44, 24);
  display.printf("T:%+4.0f\xF7", latestMountTelem.tiltDeg);
  display.setCursor(44, 34);
  display.printf("Z:%3u%%", latestMountTelem.zoomPct);

  // Zoom action badge (Y=44, 7 chars inverted)  "TELE IN" / "WIDE OUT"
  if (zoom > 100) {
    display.fillRect(40, 43, 48, 9, SH110X_WHITE);
    display.setTextColor(SH110X_BLACK);
    display.setCursor(42, 44);
    display.print("TELE IN");
    display.setTextColor(SH110X_WHITE);
  } else if (zoom < -100) {
    display.fillRect(40, 43, 48, 9, SH110X_WHITE);
    display.setTextColor(SH110X_BLACK);
    display.setCursor(42, 44);
    display.print("WIDE OUT");
    display.setTextColor(SH110X_WHITE);
  }

  // Footer row Y=55: Banner OR hint (max 21 chars)
  if (millis() < bannerExpireMs && strlen(bannerText) > 0) {
    char trunc[22];
    snprintf(trunc, sizeof(trunc), "%.21s", bannerText);
    int16_t boxW = (int16_t)(strlen(trunc) * 6 + 4);
    if (boxW > 126) boxW = 126;
    int16_t boxX = (SCREEN_WIDTH - boxW) / 2;
    display.fillRect(boxX, 53, boxW, 10, SH110X_WHITE);
    display.setTextColor(SH110X_BLACK);
    display.setCursor(boxX + 2, 55);
    display.print(trunc);
    display.setTextColor(SH110X_WHITE);
  } else {
    // "CON:Menu  B3-5:Recall" = 21 chars exactly
    display.setCursor(2, 55);
    display.print("CON:Menu B3-5:Recall");
  }
}

// ---------------------------------------------------------------------------
// Fullscreen Animated Homing Screen (Professional / No Overlap)
// ---------------------------------------------------------------------------
void drawHomingScreen() {
  uint32_t now = millis();
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // ── Title bar (full width inverted, Y=0..9) ──
  display.fillRect(0, 0, SCREEN_WIDTH, 10, SH110X_WHITE);
  display.setTextColor(SH110X_BLACK);
  drawCentered("  HOMING MOUNT  ", 1);
  display.setTextColor(SH110X_WHITE);

  // ── Pan row (Y=13) ──
  // Layout: "PAN" label + status badge + angle, all <=21 chars
  // "PAN   +40.0   ALIGN" 19 chars
  // "PAN   +40.0  SEARCH" 19 chars
  {
    const char* panStatus = latestMountTelem.panHallDetected ? "ALIGN" : "SRCH ";
    char panLine[22];
    snprintf(panLine, sizeof(panLine), "PAN %+6.1f\xF7  %-5s",
             latestMountTelem.panDeg, panStatus);
    display.setCursor(2, 13);
    display.print(panLine);
  }

  // ── Tilt row (Y=23) ──
  {
    const char* tiltStatus = latestMountTelem.tiltHallDetected ? "ALIGN" : "SRCH ";
    char tiltLine[22];
    snprintf(tiltLine, sizeof(tiltLine), "TLT %+6.1f\xF7  %-5s",
             latestMountTelem.tiltDeg, tiltStatus);
    display.setCursor(2, 23);
    display.print(tiltLine);
  }

  // ── Zoom row (Y=33) ──
  {
    char zoomLine[22];
    snprintf(zoomLine, sizeof(zoomLine), "ZOM  %3u%%  Wide->0%%", latestMountTelem.zoomPct);
    display.setCursor(2, 33);
    display.print(zoomLine);
  }

