TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
  // ── Event message (latest telemetry from mount, Y=43, max 21 chars) ──
  {
    char evLine[22];
    snprintf(evLine, sizeof(evLine), "%-21.21s", latestMountTelem.eventMsg);
    display.setCursor(2, 43);
    display.print(evLine);
  }

  // ── Animated scanner progress bar (Y=53..62) ──
  display.drawRect(2, 53, 124, 10, SH110X_WHITE);
  // Bouncing shuttle
  uint32_t period = 1200; // ms for one full pass
  uint32_t t = now % (period * 2);
  int16_t barLen = 18;
  int16_t travel = 124 - 4 - barLen; // inner pixels
  int16_t pos;
  if (t < period) {
    pos = (int16_t)((t * travel) / period);
  } else {
    pos = (int16_t)(((t - period) * travel) / period);
    pos = travel - pos;
  }
  display.fillRect(4 + pos, 55, barLen, 6, SH110X_WHITE);

  // ── Axis locked checkmarks (right side, shown when ALIGN) ──
  // Small "ok" glyphs at X=116, Y=13 and Y=23
  if (latestMountTelem.panHallDetected) {
    display.setCursor(116, 13);
    display.print("\x02"); // STX char renders as a small mark on SH110X gfx font — use a simple square
    display.fillRect(118, 14, 5, 5, SH110X_WHITE); // filled square = locked
  }
  if (latestMountTelem.tiltHallDetected) {
    display.fillRect(118, 24, 5, 5, SH110X_WHITE);
  }
}

// ---------------------------------------------------------------------------
// Presets List: 8 Slots  (4 visible, scrolling page)
// ---------------------------------------------------------------------------
void drawPresetsList() {
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Header row Y=13
  display.setCursor(2, 13);
  display.print("PRESETS  (ENC=scroll)");

  // 4 rows visible, Y=23/33/43/53
  uint8_t startIdx = (presetListSelected / 4) * 4;
  for (uint8_t i = 0; i < 4; i++) {
    uint8_t slotIdx = startIdx + i;
    if (slotIdx >= 8) break;

    int16_t y = 23 + (i * 10);
    bool isSelected = (slotIdx == presetListSelected);

    if (isSelected) {
      display.fillRect(0, y - 1, SCREEN_WIDTH, 10, SH110X_WHITE);
      display.setTextColor(SH110X_BLACK);
    } else {
      display.setTextColor(SH110X_WHITE);
    }

    // "P1 Pulpit     +40 Z99" = 21 chars max
    // Slot num + name (8 chars) + right side angle+zoom
    char nameCol[9];
    snprintf(nameCol, sizeof(nameCol), "%-8.8s", remotePresets[slotIdx].name);

    char rightCol[8];
    if (remotePresets[slotIdx].valid) {
      snprintf(rightCol, sizeof(rightCol), "%+4.0f\xF7", remotePresets[slotIdx].panDeg);
    } else {
      snprintf(rightCol, sizeof(rightCol), " EMPTY");
    }

    display.setCursor(2, y);
    display.printf("P%u %.8s", slotIdx + 1, remotePresets[slotIdx].name);

    // Right-align the angle/status
    drawRightAligned(rightCol, y, 126);

    display.setTextColor(SH110X_WHITE);
  }
}

// ---------------------------------------------------------------------------
// Preset Action Sub-Menu (Goto, Save, Rename, Back)
// ---------------------------------------------------------------------------
void drawPresetAction() {
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Header: "P1: Pulpit" — truncate name to 8 chars to stay <=18 chars total
  uint8_t slot = presetListSelected + 1;
  char header[22];
  snprintf(header, sizeof(header), "P%u: %.14s", slot, remotePresets[presetListSelected].name);
  display.setCursor(2, 13);
  display.print(header);

  // 4 action rows at Y=23/33/43/53
  static const char* shortNames[PACT_COUNT] = {
    "Goto Position",
    "Save Framing",
    "Rename",
    "Back"
  };

  for (uint8_t i = 0; i < PACT_COUNT; i++) {
    int16_t y = 23 + (i * 10);
    bool isSelected = (i == presetActSelected);

    if (isSelected) {
      display.fillRect(0, y - 1, SCREEN_WIDTH, 10, SH110X_WHITE);
      display.setTextColor(SH110X_BLACK);
    } else {
      display.setTextColor(SH110X_WHITE);
    }

    display.setCursor(4, y);
    display.printf("%u. %s", i + 1, shortNames[i]);
    display.setTextColor(SH110X_WHITE);
  }
}

// ---------------------------------------------------------------------------
// Interactive Character Wheel Name Editor
// ---------------------------------------------------------------------------
void drawNameEditor() {
  uint8_t slot = editNameSlotIdx + 1;
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Title row Y=13: "RENAME P1" (9 chars, safe)
  char title[22];
  snprintf(title, sizeof(title), "RENAME PRESET %u", slot);
  display.setCursor(2, 13);
  display.print(title);

  // Name input box Y=22..33, inner text Y=24
  display.drawRect(2, 22, 124, 12, SH110X_WHITE);
  display.setCursor(5, 24);
  display.print(editNameBuffer);
  // Blinking cursor
  if ((millis() / 400) % 2 == 0) {
    size_t len = strlen(editNameBuffer);
    int16_t curX = 5 + (int16_t)(len * 6);
    if (curX < 122) {
      display.drawFastVLine(curX, 24, 7, SH110X_WHITE);
    }
  }

  // Character ribbon (Y=37): 5 symbols, centered, 14px each
  // Positions: center=64, offsets -2,-1,0,+1,+2 → X = 8,22,36,50,64... → use 12px spacing
  // Ribbon area: 5 chars * 14px = 70px, start X = (128-70)/2 = 29
  for (int16_t off = -2; off <= 2; off++) {
    int16_t symbolIdx = (editCharIdx + off + TOTAL_EDITOR_SYMBOLS * 4) % TOTAL_EDITOR_SYMBOLS;

    int16_t xPos = 64 + off * 14 - 5; // center at 64, each slot 14px wide
    int16_t yPos = 37;

    if (off == 0) {
      display.fillRect(xPos - 2, yPos - 1, 14, 10, SH110X_WHITE);
      display.setTextColor(SH110X_BLACK);
    } else {
      display.setTextColor(SH110X_WHITE);
    }

    display.setCursor(xPos, yPos);
    if (symbolIdx == CHAR_CODE_DEL) {
      display.print("<X");
    } else if (symbolIdx == CHAR_CODE_SAVE) {
      display.print("OK");
    } else {
      display.print(CHAR_SET[symbolIdx]);
    }
    display.setTextColor(SH110X_WHITE);
  }

  // Ribbon arrows at sides
  display.setCursor(2, 37);
  display.print("<");
  display.setCursor(120, 37);
  display.print(">");

  // Footer help row Y=52 (max 21 chars)
  // "CON:Add BAK:Del OK:Sv" = 21
  display.setCursor(2, 52);
  display.print("CON:Add BAK:Del OK:Sv");
}

// ---------------------------------------------------------------------------
// Dedicated Scrolling System Log Console
// ---------------------------------------------------------------------------
void drawLogs() {
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Header Y=13 (max 21 chars: "SYSTEM LOGS  BAK:exit")
  display.setCursor(2, 13);
  display.print("SYSTEM LOGS BAK:exit");

