TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
  display.drawFastHLine(0, 22, SCREEN_WIDTH, SH110X_WHITE);

  if (logTotal == 0) {
    drawCentered("No events logged", 38);
    return;
  }

  // 5 lines visible, each row 8px high, Y=24/32/40/48/56
  uint8_t visibleLines = min((uint8_t)5, logTotal);
  for (uint8_t i = 0; i < visibleLines; i++) {
    int lineIdx = (int)logHead - 1 - (int)logScroll - (int)(visibleLines - 1 - i);
    while (lineIdx < 0) lineIdx += MAX_LOG_LINES;
    lineIdx = lineIdx % MAX_LOG_LINES;

    int16_t y = 24 + (i * 8);
    // Truncate to 21 chars to avoid overflow
    char truncated[22];
    snprintf(truncated, sizeof(truncated), "%.21s", logLines[lineIdx]);
    display.setCursor(2, y);
    display.print(truncated);
  }
}

// ---------------------------------------------------------------------------
// Mount Diagnostics Screen
// ---------------------------------------------------------------------------
void drawMountDiag() {
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Header Y=13
  display.setCursor(2, 13);
  display.print("MOUNT DIAG  BAK:exit");

  if (linkState != LINK_PAIRED || !hasMountTelem) {
    drawCentered("Searching mount...", 32);
    char chLine[22];
    snprintf(chLine, sizeof(chLine), "Scan Ch: %-2u", scanChannel);
    drawCentered(chLine, 42);
    return;
  }

  // Line 1 Y=23: "UART P:OK  T:OK" (15 chars)
  display.setCursor(2, 23);
  display.printf("UART P:%s T:%s",
                 latestMountTelem.panUartOk  ? "OK " : "ERR",
                 latestMountTelem.tiltUartOk ? "OK " : "ERR");

  // Line 2 Y=33: "HALL P:DETECT T:CLEAR" → 21 chars max
  // Use shorter tokens: "ON"/"--"
  display.setCursor(2, 33);
  display.printf("HALL P:%-6s T:%-6s",
                 latestMountTelem.panHallDetected  ? "DETCT" : "CLEAR",
                 latestMountTelem.tiltHallDetected ? "DETCT" : "CLEAR");

  // Line 3 Y=43: "PAN   +40.0  RIGHT" (18 chars)
  const char* pDir = (abs(latestMountTelem.panSteps) < 50)
                     ? "CTR" : (latestMountTelem.panSteps > 0 ? "CW " : "CCW");
  display.setCursor(2, 43);
  display.printf("PAN %+6.1f\xF7 %s", latestMountTelem.panDeg, pDir);

  // Line 4 Y=53: "TLT  -45.0  DOWN  Z:55%" → split across two short items
  const char* tDir = (abs(latestMountTelem.tiltSteps) < 25)
                     ? "CTR" : (latestMountTelem.tiltSteps > 0 ? "UP " : "DWN");
  display.setCursor(2, 53);
  display.printf("TLT %+5.1f\xF7 %s Z:%u%%",
                 latestMountTelem.tiltDeg, tDir, latestMountTelem.zoomPct);
}

// ---------------------------------------------------------------------------
// Main Menu (scrolling window of 5 rows)
// ---------------------------------------------------------------------------
void drawMenu() {
  display.setTextSize(1);
  display.setTextColor(SH110X_WHITE);

  // Title row Y=13 inverted
  display.fillRect(0, 13, SCREEN_WIDTH, 9, SH110X_WHITE);
  display.setTextColor(SH110X_BLACK);
  drawCentered("REMOTE MENU", 14);
  display.setTextColor(SH110X_WHITE);

  uint8_t windowStart = 0;
  if ((uint8_t)menuSel >= 4) {
    windowStart = min((uint8_t)(menuSel - 3), (uint8_t)(MI_COUNT - 5));
  }

  // 4 rows at Y=23/33/43/53
  for (uint8_t row = 0; row < 4; row++) {
    uint8_t i = windowStart + row;
    if (i >= MI_COUNT) break;

    int16_t y = 23 + row * 10;
    bool isSelected = (i == (uint8_t)menuSel);
    bool isEditing  = isSelected && menuEditing;

    if (isSelected) {
      display.fillRect(0, y - 1, SCREEN_WIDTH, 10, SH110X_WHITE);
      display.setTextColor(SH110X_BLACK);
    } else {
      display.setTextColor(SH110X_WHITE);
    }

    display.setCursor(4, y);
    display.print(MENU_NAMES[i]);

    char val[8];
    menuValueStr((MenuItem)i, val, sizeof(val));
    if (strlen(val) > 0) {
      // Right-align value (with edit arrow if editing)
      char valStr[10];
      if (isEditing) snprintf(valStr, sizeof(valStr), "%s<", val);
      else           strncpy(valStr, val, sizeof(valStr));
      drawRightAligned(valStr, y, 124);
    }

    display.setTextColor(SH110X_WHITE);
  }

  // Scroll indicator dots bottom-right
  if (MI_COUNT > 4) {
    uint8_t pageMax = (MI_COUNT - 1) / 4;
    uint8_t curPage = (uint8_t)menuSel / 4;
    for (uint8_t p = 0; p <= pageMax; p++) {
      if (p == curPage) display.fillRect(123, 23 + p * 8, 3, 3, SH110X_WHITE);
      else              display.drawRect(123, 23 + p * 8, 3, 3, SH110X_WHITE);
    }
  }
}

// ---------------------------------------------------------------------------
// Serial Terminal Diagnostic Console
// ---------------------------------------------------------------------------
void printMountConsoleSerial(bool forcePrint = false) {
  uint32_t now = millis();
  static uint32_t lastConsolePrintMs = 0;
  if (!forcePrint && (now - lastConsolePrintMs < 3000)) return;
  lastConsolePrintMs = now;

  if (linkState != LINK_PAIRED || !hasMountTelem) {
    Serial.printf("[MOUNT CONSOLE] Searching for Mount telemetry... (Ch %u, Link: %s)\n",
                  scanChannel, (linkState == LINK_PAIRED) ? "PAIRED" : "SCANNING");
    return;
  }

  Serial.println("\n+---------------------- [MOUNT CONSOLE] ----------------------+");
  Serial.printf("| UART Drivers  : Pan: %s (0x%02X) | Tilt: %s (0x%02X)\n",
                latestMountTelem.panUartOk ? "OK [PASS]" : "FAIL [ERROR]",
                latestMountTelem.panVersion,
                latestMountTelem.tiltUartOk ? "OK [PASS]" : "FAIL [ERROR]",
                latestMountTelem.tiltVersion);
  Serial.printf("| Hall Sensors  : Pan: %s | Tilt: %s\n",
                latestMountTelem.panHallDetected ? "DETECTED (At Center Magnet!)" : "CLEAR (No Magnet)",
                latestMountTelem.tiltHallDetected ? "DETECTED (At Center Magnet!)" : "CLEAR (No Magnet)");

  const char* panDirStr = (latestMountTelem.panHallDetected || latestMountTelem.panSteps == 0)
                          ? "CENTER (Aligned with Hall)"
                          : (latestMountTelem.panSteps > 0 ? "RIGHT / CW of Hall" : "LEFT / CCW of Hall");
  const char* tiltDirStr = (latestMountTelem.tiltHallDetected || latestMountTelem.tiltSteps == 0)
                           ? "CENTER (Aligned with Hall)"
                           : (latestMountTelem.tiltSteps > 0 ? "UP of Hall" : "DOWN of Hall");

  Serial.printf("| Pan Position  : %+5ld stp (%+6.1f°) -> %s\n",
                latestMountTelem.panSteps, latestMountTelem.panDeg, panDirStr);
  Serial.printf("| Tilt Position : %+5ld stp (%+6.1f°) -> %s\n",
                latestMountTelem.tiltSteps, latestMountTelem.tiltDeg, tiltDirStr);
  Serial.printf("| Optical Zoom  : %4u ms / %u ms (%3u%% Telephoto)\n",
                latestMountTelem.zoomMs, ZOOM_FULL_RANGE_MS, latestMountTelem.zoomPct);

  const char* stateStr = "IDLE (Standstill)";
  if (latestMountTelem.state == 1)      stateStr = "LIVE MOTOR MOTION";
  else if (latestMountTelem.state == 2) stateStr = "HOMING IN PROGRESS";
  else if (latestMountTelem.state == 3) stateStr = "MOVING TO PRESET";

  Serial.printf("| Mount State   : %s [100%% Torque Locked]\n", stateStr);
  if (strlen(latestMountTelem.eventMsg) > 0) {
    Serial.printf("| Last Event    : %s\n", latestMountTelem.eventMsg);
  }
  Serial.println("+-------------------------------------------------------------+\n");
}

