TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
void printButtonsSerial() {
  Serial.println("\n--- Remote Pushbutton & Pin Status ---");
  Serial.printf("  Left Stick SW  (GPIO 15): Pin=%d, Rest=%d -> %s\n", digitalRead(PIN_LJOY_SW), btnLJoy.restingState, btnLJoy.stable ? "PRESSED" : "RELEASED");
  Serial.printf("  Right Stick SW (GPIO 16): Pin=%d, Rest=%d -> %s\n", digitalRead(PIN_RJOY_SW), btnRJoy.restingState, btnRJoy.stable ? "PRESSED" : "RELEASED");
  Serial.printf("  Encoder Push   (GPIO 12): Pin=%d, Rest=%d -> %s\n", digitalRead(PIN_ENC_BTN), btnEnc.restingState, btnEnc.stable ? "PRESSED" : "RELEASED");
  Serial.printf("  Confirm Button (GPIO 13): Pin=%d, Rest=%d -> %s\n", digitalRead(PIN_BTN_CON), btnCon.restingState, btnCon.stable ? "PRESSED" : "RELEASED");
  Serial.printf("  Back Button    (GPIO 17): Pin=%d, Rest=%d -> %s\n", digitalRead(PIN_BTN_BAK), btnBak.restingState, btnBak.stable ? "PRESSED" : "RELEASED");
  for (uint8_t i = 0; i < 5; i++) {
    Serial.printf("  Color Button %u (GPIO %d): Pin=%d, Rest=%d -> %s\n",
                  i + 1, PIN_COLOR_BTNS[i], digitalRead(PIN_COLOR_BTNS[i]), btnColor[i].restingState, btnColor[i].stable ? "PRESSED" : "RELEASED");
  }
  Serial.println("--------------------------------------\n");
}

void processSerialCli() {
  if (!Serial.available()) return;
  String line = Serial.readStringUntil('\n');
  line.trim();
  if (line.length() == 0) return;

  String cmd = line;
  int arg = 0;
  int spaceIdx = line.indexOf(' ');
  if (spaceIdx > 0) {
    cmd = line.substring(0, spaceIdx);
    arg = line.substring(spaceIdx + 1).toInt();
  }
  cmd.toLowerCase();

  if (cmd == "help" || cmd == "?") {
    Serial.println("\n--- PTZ Remote Controller CLI Commands ---");
    Serial.println("  mount         : Display live Mount Diagnostics Console (UART, Hall, Zoom, Angles)");
    Serial.println("  buttons       : Print live voltage & state of all remote pushbuttons");
    Serial.println("  save <1-8>    : Save current framing to Preset slot");
    Serial.println("  goto <1-8>    : Smoothly move camera to Preset slot");
    Serial.println("  home          : Trigger full Pan, Tilt & Zoom homing");
    Serial.println("  diag          : Switch OLED display to Mount Diagnostics screen");
    Serial.println("  main          : Switch OLED display to Main Dials screen");
    Serial.println("  presets       : List all configured presets & names");
    Serial.println("  status        : Print current sticks, link status, and full mount telemetry");
    Serial.println("-------------------------------------------\n");
  } else if (cmd == "buttons" || cmd == "pins") {
    printButtonsSerial();
  } else if (cmd == "mount" || cmd == "telemetry") {
    printMountConsoleSerial(true);
  } else if (cmd == "diag") {
    uiMode = UI_DIAG;
    Serial.println("OLED switched to Mount Diagnostics screen.");
  } else if (cmd == "presets") {
    uiMode = UI_PRESETS_LIST;
    Serial.println("OLED switched to Presets List.");
    Serial.println("--- Remote Presets Cache ---");
    for (uint8_t i = 0; i < 8; i++) {
      if (remotePresets[i].valid) {
        Serial.printf("  P%u [%s]: Pan=%+5.1f deg, Tilt=%+5.1f deg, Zoom=%u%%\n",
                      i + 1, remotePresets[i].name, remotePresets[i].panDeg, remotePresets[i].tiltDeg, remotePresets[i].zoomPct);
      } else {
        Serial.printf("  P%u [%s]: [EMPTY]\n", i + 1, remotePresets[i].name);
      }
    }
  } else if (cmd == "logs") {
    uiMode = UI_LOGS;
    Serial.println("OLED switched to System Logs screen.");
    Serial.println("--- System Log History ---");
    for (uint8_t i = 0; i < logTotal; i++) {
      int idx = (int)logHead - 1 - (int)(logTotal - 1 - i);
      while (idx < 0) idx += MAX_LOG_LINES;
      Serial.printf("  [%u] %s\n", i + 1, logLines[idx % MAX_LOG_LINES]);
    }
  } else if (cmd == "main") {
    uiMode = UI_LIVE;
    Serial.println("OLED switched to Main Dials screen.");
  } else if (cmd == "save") {
    if (arg >= 1 && arg <= 8) commandSavePreset(arg);
    else Serial.println("Error: Slot must be 1 to 8 (e.g., 'save 1')");
  } else if (cmd == "goto") {
    if (arg >= 1 && arg <= 8) commandGotoPreset(arg);
    else Serial.println("Error: Slot must be 1 to 8 (e.g., 'goto 1')");
  } else if (cmd == "home") {
    commandStartHoming();
  } else if (cmd == "status") {
    Serial.printf("[Status] Link: %s (Ch %u) | UI: %u | Active Slot: P%u [%s]\n",
                  (linkState == LINK_PAIRED) ? "PAIRED" : "SCANNING",
                  mountChannel, (uint8_t)uiMode, activePresetSlot,
                  remotePresets[activePresetSlot - 1].name);
    printMountConsoleSerial(true);
  } else {
    Serial.printf("Unknown command: '%s'. Type 'help' for available commands.\n", cmd.c_str());
  }
}

// ---------------------------------------------------------------------------
// Arduino setup()
// ---------------------------------------------------------------------------
void setup() {
  delay(500);
  setCpuFrequencyMhz(240);  // 240 MHz maximum CPU speed for lightning-fast UI and ADC response
  Serial.begin(115200);

  loadSettings();
  loadRemotePresets();

  // Analog pin configuration
  const uint8_t adcPins[] = {PIN_BATT_ADC, PIN_USB_SENSE,
                             PIN_LJOY_X, PIN_LJOY_Y, PIN_RJOY_X, PIN_RJOY_Y};
  for (uint8_t i = 0; i < sizeof(adcPins); i++) {
    analogSetPinAttenuation(adcPins[i], ADC_11db);
    pinMode(adcPins[i], INPUT);
  }

  // Calibrate joystick resting centers
  calibrateJoysticks();

  // Pushbutton digital inputs with internal pull-up resistors
  buttonInit(btnLJoy, PIN_LJOY_SW);
  buttonInit(btnRJoy, PIN_RJOY_SW);
  buttonInit(btnEnc,  PIN_ENC_BTN);
  buttonInit(btnCon,  PIN_BTN_CON);
  buttonInit(btnBak,  PIN_BTN_BAK);
  for (uint8_t i = 0; i < 5; i++) {
    buttonInit(btnColor[i], PIN_COLOR_BTNS[i]);
  }

  // Calibrate baseline resting level for all pushbuttons
  calibrateButtonRestingState();

  // Rotary encoder interrupts
  pinMode(PIN_ENC_A, INPUT_PULLUP);
  pinMode(PIN_ENC_B, INPUT_PULLUP);
  encLastAB = (digitalRead(PIN_ENC_A) << 1) | digitalRead(PIN_ENC_B);
  attachInterrupt(digitalPinToInterrupt(PIN_ENC_A), encoderISR, CHANGE);
  attachInterrupt(digitalPinToInterrupt(PIN_ENC_B), encoderISR, CHANGE);

  // Initialize Adafruit SH110X (SH1106G 1.3" OLED)
  Wire.begin(PIN_I2C_SDA, PIN_I2C_SCL);
  Wire.setClock(I2C_CLOCK);

  if (!display.begin(OLED_ADDR, true)) {
    Serial.println("[OLED ERROR] Adafruit SH1106G init failed - check I2C wiring (SDA:8, SCL:9)!");
  } else {
    displayActive = true;
    display.setContrast(settings.brightness);
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(SH110X_WHITE);
    display.setCursor(14, 20);
    display.print("PTZ CAMERA REMOTE");
    display.setCursor(18, 36);
    display.print("SONY FDR-AX53");
    display.display();
    delay(300);
  }

  // Initialize Wi-Fi in Station Mode & ESP-NOW with Maximum RF Power (21 dBm)
  WiFi.mode(WIFI_STA);
  esp_wifi_set_max_tx_power(84); // 21.0 dBm absolute hardware max limit
  WiFi.disconnect();

