TheInventingKnight/a_r-d.u-i_n-o/ESP32S3_Remote_TX/ESP32S3_Remote_TX.ino
  if (esp_now_init() != ESP_OK) {
    Serial.println("ESP-NOW init failed, rebooting...");
    ESP.restart();
  }
  esp_now_register_recv_cb(onEspNowRecv);
  esp_now_register_send_cb(onEspNowSent);

  // Register broadcast peer with channel 0 (follows active STA channel)
  espNowAddPeer(BCAST_MAC, 0);

  scanChannel = loadLinkChannel();
  Serial.printf("Remote MAC: %s | Max RF Power (21 dBm) @ 240 MHz | Scan Ch: %u...\n",
                WiFi.macAddress().c_str(), scanChannel);

  addLog("Remote OS (240MHz) Boot");
}

// ---------------------------------------------------------------------------
// Arduino loop()
// ---------------------------------------------------------------------------
void loop() {
  uint32_t now = millis();

  // 1. Process USB Serial CLI
  processSerialCli();

  // 2. Link Management & Channel Scanning
  updateLink(now);

  // 3. Update all button debouncers with baseline calibration
  updateAllButtons();

  // 4. Read Joysticks: Left Stick X -> Pan, Right Stick Y -> Tilt
  float lx = joyAxis(PIN_LJOY_X);
  float rx = joyAxis(PIN_RJOY_X);
  float ry = joyAxis(PIN_RJOY_Y);

  if (settings.invertPan)  lx = -lx;
  if (settings.invertTilt) ry = -ry;

  int16_t pan  = (int16_t)constrain(lx * settings.sensitivity * 1000.0f, -1000, 1000);
  int16_t tilt = (int16_t)constrain(ry * settings.sensitivity * 1000.0f, -1000, 1000);
  int16_t auxX = (int16_t)(rx * 1000.0f);

  // 5. Zoom Buttons: Color Btn 1 (GPIO 38) -> Zoom In, Color Btn 2 (GPIO 39) -> Zoom Out
  int16_t zoom = 0;
  if (uiMode == UI_LIVE) {
    if (btnColor[0].stable) {
      zoom = 1000;  // Zoom In / Telephoto
    } else if (btnColor[1].stable) {
      zoom = -1000; // Zoom Out / Wide
    }
  } else {
    // When in Homing, Menus, or Dialogs, suppress stick and zoom motion
    pan = 0;
    tilt = 0;
    zoom = 0;
  }

  // 6. Read Rotary Encoder & Menu Navigation
  int detents = encoderDetents();
  handleMenuInput(detents);

  // 7. Joystick Button Click Actions (Optional Shortcuts)
  if (uiMode == UI_LIVE && buttonPressed(btnLJoy)) {
    // Left Stick Click: Cycle active preset slot (P1 -> P2 -> ... -> P8 -> P1)
    activePresetSlot = (activePresetSlot % 8) + 1;
    char b[24];
    snprintf(b, sizeof(b), "ACTIVE: [%s]", remotePresets[activePresetSlot - 1].name);
    showBanner(b, 1800);
  }

  // 8. Quick Recall Buttons: Color Buttons 3..5 (GPIO 40..42) -> Instant Recall Preset 1, 2, 3
  if (uiMode == UI_LIVE) {
    for (uint8_t i = 2; i < 5; i++) {
      if (buttonPressed(btnColor[i])) {
        uint8_t slot = (i - 2) + 1; // Btn3->P1, Btn4->P2, Btn5->P3
        commandGotoPreset(slot);
      }
    }
  }

  // 9. Stream 50 Hz Control Packets while Paired
  if (linkState == LINK_PAIRED && now - lastTxMs >= TX_INTERVAL_MS) {
    lastTxMs = now;
    sendControl(pan, tilt, zoom, auxX, buildButtonBits());
  }

  // 10. Render OLED Display (1.3" Adafruit SH1106G)
  if (displayActive) {
    display.clearDisplay(); // Always clear entire buffer before rendering frame

    if (linkState != LINK_PAIRED) {
      drawSearchingScreen();
    } else if (uiMode == UI_HOMING) {
      drawHomingScreen();
    } else {
      drawStatusBar();

      if (uiMode == UI_MENU) {
        drawMenu();
      } else if (uiMode == UI_PRESETS_LIST) {
        drawPresetsList();
      } else if (uiMode == UI_PRESET_ACTION) {
        drawPresetAction();
      } else if (uiMode == UI_NAME_EDITOR) {
        drawNameEditor();
      } else if (uiMode == UI_LOGS) {
        drawLogs();
      } else if (uiMode == UI_DIAG) {
        drawMountDiag();
      } else {
        drawMainUi(pan, tilt, zoom);
      }
    }
    display.display();
  }

  // 11. Periodic Serial Terminal Console (every 3 seconds)
  printMountConsoleSerial(false);

  delay(5);
}
